#+TITLE: Kabir's Fish Config
#+AUTHOR: Kabir Kwatra
#+EMAIL: kabir@kwatra.me
#+LANGUAGE: en
#+STARTUP: noinlineimages
#+OPTIONS: toc:nil

[[https://asciinema.org/a/459391][./.github/assets/screenshot.svg]]

** Installation
#+begin_src sh
git clone https://github.com/Kab1r/.fish ~/.config/fish
#+end_src
#+begin_src fish :results drawer
fisher update
#+end_src

#+RESULTS:
:results:
update version
Fetching
Fetching
Fetching
           /home/kabir/.config/fish/functions/__history_previous_command.fish
           /home/kabir/.config/fish/functions/__history_previous_command_arguments.fish
           /home/kabir/.config/fish/conf.d/plugin-bang-bang.fish
           /home/kabir/.config/fish/functions/fisher.fish
           /home/kabir/.config/fish/completions/fisher.fish
           /home/kabir/.config/fish/functions/spark.fish
           /home/kabir/.config/fish/completions/spark.fish
Updated 3 plugin/s
:end:

